bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/Catalogs/РегламентныеПериоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РегламентныеПериоды</Name>
			<Hierarchical>false</Hierarchical>
		</Properties>
	</Catalog>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/Documents/ПланРегламентныхОперацийДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланРегламентныхОперацийДУ</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорДУ</Name>
					<Type><v8:Type>cfg:CatalogRef.ДоговорДУ</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОперацийПользователя</Name>
					<Type><v8:Type>cfg:CatalogRef.ВидыОперацийЗакрытияПериода</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланВечернихОпераций</Name>					<Type>
						<v8:Type>cfg:DocumentRef.ПланРегламентныхОперацийДУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/Catalogs/РегламентныеПериоды/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область IMDEV_8663_2_ПроверкаПлановГруппыСЧА

// Описание: Возвращает Истина, если по договорам за дату есть планы группы "3. Расчет СЧА/РСА"
// без пометки удаления (текущий расчет СЧА/РСА станет неактуальным после пересчета вечерних).
//
// Параметры:
//  ДатаПериода - Дата - дата регламентного периода
//  СписокДоговоровДУ - Массив - отобранные договоры ДУ
//
// Возвращаемое значение:
//  Булево - Истина, если найден хотя бы один план группы 3 без пометки удаления
//
// Пример:
//  ЕстьПланы = Справочники.РегламентныеПериоды.IM86632_ЕстьПланыГруппыСЧА(ДатаПериода, СписокДоговоровДУ);
//
Функция IM86632_ЕстьПланыГруппыСЧА(ДатаПериода, СписокДоговоровДУ) Экспорт

    Если СписокДоговоровДУ = Неопределено Или СписокДоговоровДУ.Количество() = 0 Тогда
        Возврат Ложь;
    КонецЕсли;

    ГруппаСЧА = Справочники.ВидыОперацийЗакрытияПериода.НайтиПоКоду("3. ""Расчет СЧА/РСА""");
    Если ГруппаСЧА.Пустая() Тогда
        Возврат Ложь;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    ПланРегламентныхОперацийДУ.Ссылка
    |ИЗ
    |    Документ.ПланРегламентныхОперацийДУ КАК ПланРегламентныхОперацийДУ
    |ГДЕ
    |    ПланРегламентныхОперацийДУ.ДоговорДУ В (&СписокДоговоровДУ)
    |    И ПланРегламентныхОперацийДУ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |    И ПланРегламентныхОперацийДУ.ГруппаОперацийПользователя = &ГруппаСЧА
    |    И НЕ ПланРегламентныхОперацийДУ.ПометкаУдаления";

    Запрос.УстановитьПараметр("СписокДоговоровДУ", СписокДоговоровДУ);
    Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаПериода));
    Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаПериода));
    Запрос.УстановитьПараметр("ГруппаСЧА", ГруппаСЧА);

    Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти

#КонецОбласти
